Tekla Open API Reference for Tekla Structures 2025
AnalysisResult.DeleteLoadcase Method
 Delete analysis results by load case.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool DeleteLoadcase(
	int loadcaseNumber,
	string loadcaseName
)
Public Shared Function DeleteLoadcase (
	loadcaseNumber As Integer,
	loadcaseName As String
) As Boolean
Parameters
loadcaseNumber
Type: System.Int32
Object type.
loadcaseName
Type: System.String
Object id.
Return Value
Type: Boolean
True if successful.
Examples
 Delete all analysis results of part.
var result = AnalysisResult.DeleteLoadcase(11, "ULS1");
See Also
Reference
AnalysisResult Class
Tekla.Structures.Analysis Namespace